= 2002.11.28(18時) 自宅サーバ
DreamNetのWebページをやめて、自宅サーバ一本に変更しました。

= 2002.11.27(19時) Q's Nicolatter for X 1.7.5
((<Nicolatter|URL:http://www.nslabs.jp/xnicolatter.rhtml>)) の最新バージョンをインストールしてみました。
このソースをそのままコンパイルして、Vine2.5 にインストールすると問題がありましたが、((<だすさんのページ|URL:http://www.coara.or.jp/~sudakyo/NICOLA_way.html>)) にある RPM を使うと問題が解決しました。どうも FreeWnn に対するパッチがあるみたいです。
シフト操作の反応が遅いことと、変換操作がシフト操作として認識されてしまうことが前から気になっていましたが、 syncshift.cc の SAME_TIME を 80 ぐらいに変更するとなかなかいい感じになりました。
長いこと更新していませんでしたが、その間に富士通のUSBコンパクト親指シフトキーボードを購入してしまいました。また、レポートしたいと思います。

= 2002.6.5(13時) FreeWnnとnicolatter
VineLinux2.5に乗り換えた。ATOK Xは今は使っていない。方針を変えて、FreeWnnを賢く使える方法を探ることにした。
探してみると、フリーの辞書が結構見つかった。
大阪弁にもある程度対応しているようなので、結構便利かもしれない。
親指シフト環境はnicolatterを利用させてもらった。
最初はローマ字入力をしていたのですが、FreeWnnでのローマ字入力はなかなか面白い機能がある。例えば「z-」とタイプすると「〜」がいきなりでてきたり、「zl」とタイプすると「→」となったりする。矢印記号はviでの移動キーと同じ法則なので、「zl」の他にも「zh」「zj」「zk」がそれぞれ「←」「↓」「↑」になる。
nicolatterも初期設定では少し使いにくいので、どうカスタマイズするかこれから考えることにしたい。

= 2002.5.15(20時) Vine2.5とATOK X
Vine2.5はATOK Xをサポートしないらしい。
Wnn7を買うか、Canna/FreeWnnで我慢しろということなのか。Wnn7を買うにはお金が必要じゃないか(^^;
やはりVineに乗り換えるのはやめにしようかな...

= 2002.5.14(20時) USB外付けハードディスク購入
会社のPCと私物のPCを同期させる目的でUSB外付けハードディスクケース(MD2-USBというやつ)を購入しました。
RedHat7.1やVineの最近のバージョンで動作することを確認しました。
転送速度は遅いけど、なかなか便利です。

= 2002.5.9(13時) 目的が不明瞭な帳票
今の会社ではいろいろな帳票が使用されていますが、その帳票の目的が不明瞭なものが多くて困っています。
帳票の用紙だけを作成して、その目的を(さらにそれぞれの項目についての目的も)残さないというのはナンセンスですよね。
しかも、少しずつ記入する項目が増えていく一方で、記入する側の負担がおおきくなり、さらにワークフローはスパゲッティのようにぐちゃぐちゃになっています。
なんとかしたいけど、目的がはっきりしない項目が多く、項目1つ1つに対しての目的を関係者に聞き込み調査しないといけないので、簡単にはいきません(^^;

= 2002.5.7(13時) Fire Crystal
ずいぶん昔の話しですが、PC-8801というパソコンでFire CrystalというRPGゲームがありました。あまりに難しくて、解くことができなかった数少ないゲームのうちの一つです。
それが、最近ある掲示板を読んだところ、このゲームにはバグがあったとの情報がありました。
セーブした魔法使いの最大マジックポイントがレベル1のときの状態に戻ってしまうというバグだそうです。
「...解けるはずないやん...」と私は心の中でつぶやきました。
ドラクエで例えると、せっかくバギやベギラマを覚えても、一度も唱えることができないといった感じのバグです。
謝罪して欲しい...時間を返して欲しい...＞B.P.S.(メーカー)
ついでに続編のMoon Stoneはいつ発売するのでしょうか。

= 2002.4.16(13時) ちょっと気になるキーボード
知らない間に富士通からUSBコンパクト親指シフトキーボードがでていました。
* ((<URL:http://software.fujitsu.com/jp/oasys/2002/kanren2002.html#usbmini>))
でも、14,800円はちょっと高いなぁ。

= 2002.4.15(18時) 復活
仕事が忙しいことを理由に4ヶ月近く放置していましたが、そろそろマシになってきたので、フリーソフト開発に戻ろうかと思います。
linux用のATOK X(正確にはiiimf)を無理矢理、親指シフト化しました。パッチを公開できるように準備中です。(あまり需要がないかな...)

= 2001.12.3(12時) DreamNetのJava Web Start対応(3)
ようやくDreamNetから返事があり、Java Web Startに対応されました。ややこしい、インストール作業が不要になるので、ぜひ試してみてください。現状ではHTML生成変換ツールのみ対応していますが、今後増やしていきたいと考えています。

= 2001.11.17(11時) DreamNetのJava Web Start対応(2)
DreamNetのJava Web Startは未だに何も進展していない。商用プロバイダのWebサーバーはなんとも融通が利かないもんだ。
こうなったら、自前のWebサーバーを構築したいが、Yahoo!BBはまだ接続できていないし、サーバーPCもない。どうしたものか。サーバーPCは省電力、静音を満たす必要がある。

= 2001.11.5(13時) DreamNetのJava Web Start対応(1)
DreamNetに、MIMEタイプapplication/x-java-jnlp-fileを登録してもらうようにメールで依頼してみた。数日間返事が来なかったが、やっと返事が来た。一応、対応してくれそうな感じの返事だった。早く対応してくれればうれしいのだが...
ちなみにDreamNetのHTTPサーバーはApacheを使用してるようだ。/etc/mime.typesに1行追加するだけで簡単に対応可能なので、ぜひ早くして欲しい。
Java Web Startに対応したら、JavaランチャーやJavaインストーラは不要になるかも。しかし、CD-ROMに添付する場合はやっぱり必要かな。Java Web Startはオフラインでは使えないような感じがするし。いや、使えるのかもしれないなぁ。なんにせよ、調査が必要である。

= 2001.10.31(13時) Java Web Start
JavaアプリケーションのWebでの配布が可能なJava Web Startというのを最近知った。このページで紹介しているソフトも順次、Java Web Start に対応していきたい。
しかし、DreamNetのHTTPサーバーにはMIMEタイプapplication/x-java-jnlp-fileが登録されていないらしい。DreamNetに依頼して、登録してもらう必要があるようだ。
.htaccessというファイルを使えば、ユーザーごとにMIMEタイプを設定可能だが、これも禁止されているようだ。ということで、Java Web Startへの対応はもう少し時間がかかりそうである。

= 2001.10.4(0時) ATOK Xと親指シフト
FreeWnnの漢字変換に我慢できず、ATOK Xを買ってしまった。しかし、親指シフト環境がうまく構築できない。「えせかんな」というフリーソフトを使って、「かんな」と同じように見えるようにするのだが、ATOK X用のモジュールがまだ開発版しかなくて、2回目の変換でコケてしまう。ソースも公開されているので、時間があったら調査したいと思う。
ということで、今はローマ字入力なのですが、やっぱり親指シフトに比べると、入力がしんどい。しかし、変換精度の高いATOK Xの方を優先したいので、しかたない。商用版WnnやATOK12を選択した方が良かったかな...

= 2001.9.22(9時) Xでのキーカスタマイズ
linuxのX Windowを使っていると、キーカスタマイズが柔軟なので、大変助かる。Windowsではできないようなカスタマイズも、標準で可能だ。このようなことはOSのレベルでサポートされるべきだと思う。

= 2001.9.17(23時) 頭痛
ようやく傷口が塞がってきた今日この頃。ひさびさにWebの更新する元気があったので、ちょっと更新。
私は頭痛持ちなのだが、仕事の日はあまり頭痛にならないような気がする。休日は寝過ぎなのかもしれない。
しかし、低血圧な私は朝は辛いので、ついつい二度寝してしまう。どうにかならないものだろうか。(^^;

= 2001.8.30(23時) 良いソフトが死んでいく...
みなさん、ワープロソフトは何をお使いでしょうか。私は会社でWordが標準なので、仕方なしにWordを使っております。しかし、最近、Linuxに乗り換えたため、Wordの文書を読むのに苦労します。
メールである議事録が回ってきました。最初はwvWareというフリーソフトでHTML変換を試みましたが、このファイルはなぜか変換できませんでした。次に一太郎ArkというJavaで動作するワープロを試しにインストールして、見てみました。すると一見、ちゃんと表示されました。
しかし、良く見ると日付がおかしいし、内容も前回の打ち合せのことが書いてあります。仕方なしにWindowsのWordで見てみると、ちゃんと今回の打ち合せのことが書いてありました。
私はわけがわからなくなり、「もしかして、過去に編集した内容がファイルにすべて記録されているのでは?」と考えるようになりました。インターネットで検索したところ、この考えは正しいことがわかりました。
どうやら、この現象はWordのバグのようです。しかし、過去の編集内容が記録されていたら、社外秘の文書が外部にもれる恐れがあるし、ファイルサイズはどんどんでかくなるし、「サイテーなソフトやなぁ」って思いました。
あるサイトによるとクラリスワークスというソフトが良いらしいのですが、もう生産中止になったそうです。
本当に良いソフトが生産中止になり、悪いソフトが生き残る。これって、間違ってますよね。

= 2001.8.30(0時) 野犬
野犬に追いかけられた。仕事が終って、会社(南港)から自転車で帰ろうとすると、いきなり野犬が5匹ほど吠えながら追いかけてきた。焦った私は振り切ろうと思い自転車をこぐが、なかなか振り切れない。「噛まれる!」とかびびりながら、周りを確認するとまだ左右に一匹ずつおる。やっと、右の一匹だけになったが、恐いので、右足で軽く蹴ってみた。それであきらめたのか、ついてこなくなって安心したが、良く見ると大きく左に寄っていることに気付いた。
その直後、減速してはみたものの、歩道に乗り上げ、転倒してしまった。おかげで、スリ傷と打撲。その後は外れたチェーンの自然復旧を試みながら、慌てて帰ったのであった。
犬って恐い。

= 2001.8.29 自作ソフトが雑誌に掲載
掲示版が本当に「なんでも掲示版」になっている..(^^)
それはさておき、私のソフトが本に掲載されることになったらしい。9/18発売のWindows Powerという雑誌の55,59ページだそうだ。いやー、こんなことははじめてなのでうれしいです。その昔、ザナドゥというゲームのクリアしたときに名前が載ったとき以来ですわ。(古い...)

= 2001.8.21 テキストブラウザ
テキストブラウザに凝ってます。lynxを使ってたのですが、Googleの検索ができないなどの不具合があり、修正用のコードをダウンロードしないといけないなど、めんどくさいことがあったので、w3mというブラウザを試してみました。
最初はうまく動作しませんでした。libなんちゃら.so.2とかがリンクできないとかいうエラーメッセージがあったので、無理矢理libなんちゃら.so.2とかをシンボリックリンクしたらとりあえず動作しました。多分、SSL関連がちゃんと動かないような気がしますが、まあ、今はそこまで要求しないので、気にせずに使い方をマスターしようとつかってみました。
しかし、今度は日本語がちゃんと表示されません。よく調べるとダウンロードしたソフトはベータ版らしく、正式版をインストールしなおしたら、うまくいきました。
テキストベースのメーラー(MUA)はmnewsを使っているのですが、たまにURLの入ったメールを受け取ったときに、ブラウザで開くのが面倒だったのですが、パイプコマンドの"|"を使って、"|w3m"としたあとで、":"キーを押すと、URLの部分の色が変わり、ジャンプすることができました。いやー、快適です。
さらに"M"を押すと、設定されている外部ブラウザーに渡すことができるので、"mozilla"を"~/.w3m/config"に設定し、かなりよい環境になりました。
いやー、フリーソフトさまさまです。:-)
あ、ちなみに /usr/share/w3m/ にある、index-*.html は消さないと、パイプ実行した時に、RedHatのページが開いてしまいました。"|w3m -T text/plain" とすれば問題ないみたいです。

= 2001.8.19 Linuxに移行
やっとページの更新ができました。Windowsの環境からLinuxに移行したため、今まで利用していた数々のソフトが使えなくなり、代わりになるソフトのインストールやら設定などで時間がかかってしまいました。とりあえず、ある程度主要なソフトは導入したので、落ち着いてきました。
今後はセットアップ時に苦労したことなど、少しずつ公開していきたいと思います。

= 2001.8.6 社内教育
またまた怒りネタになって恐縮ですが、会社でいやなことがあったので書かせてください。
会社で社内研修があり、感想文を書かされました。感想文の内容に自分の思っていること、「もっと役に立つ研修を希望します。」と書きました。すると研修を主催している部署のエライさんが、「綺麗に書かれた文句」とおっしゃられ、さらに「本当に能力のある社員なのか？」とうちの部署の(だいぶ上の方の)上司にメールされました。上司は私のことをよくご存じなので、私のことをかばってくれました。しかし、エライさんはまだ納得いってないみたいでして、今度は「コミュニケーション能力が不足しているのでは？」という内容で社長宛に意見を求めてらっしゃいました。社長は「社内教育は改善していくべきだ」という内容で返信されてました。
私は感想文を求められたので、感想を書いただけなのですが、どうやら気に入らなかったらしいのです。じゃあ、感想文っていったい何？無難なことを書いておけばそれでええの？「大変役に立ちました。仕事に役立てていきたいと思います。」みたいな感想ならええの？感想文を書かす目的って、いったいなんなのさ？

= 2001.7.22 切符の払い戻し不可
このまえ、切符を買い間違えた。50円多く買ってしまったのだが、時間が無かったため、そのまま電車に乗り、降りた駅で払い戻しをお願いすると「できません。」と言われた。乗り越し精算する機械は完備されているのに、途中下車するためのシステムが無いとは、なんとも情けない電鉄会社だ。おそらく金を取ることしか考えていないのだろう。

= 2001.7.9 ソフトバージョンアップ
HTML生成変換ツールをファイルのドラッグアンドドロップに対応しました。また、GUIを使っての変換時にインクルード文の処理にバグがあり、修正しました。

= 2001.7.7 インターネットは便利!
仕事で工程管理用に作ったソフトをGUIを付けて公開しました。ファイルのドラッグアンドドロップに対応するのにちょっと苦労しましたが、インターネットでいろいろ検索したら、なんとかなりました。インターネットは便利ですね。HTML生成変換ツールの方にも近いうちに実装したいと思います。
