= 名作ゲーム

ここでは私が名作だと思ったゲームを紹介していきます。

== トルネコの大冒険(工事中)
== 風来のシレン(工事中)
== 風来のシレンWindows版(工事中)
== トルネコの大冒険2
=== セーブできないときは電源つけっぱなし作戦
このゲームで「もっと不思議のダンジョン」をプレイしていると、全然セーブ(中断)できないということがわかってくると思う。私はこれで一回いやになってやめていたのだが、「電源をつけっぱなしにしたら解決するじゃないか。」と思い、再びチャレンジ中だ。38階ぐらいまで来たが、風来のシレンに比べると難易度が低いように感じた。

=== 無事100階達成
やはり、シレンより難易度が低かった。大したトラブルもなく100階を達成してしまった。シレンでのフェイの最終問題も1回でクリアしたが、これよりも簡単だった。(ちなみにシレンは掛け軸裏の方が難しい。)

途中ではぐれメタルが出てきたときは分裂の杖と吹き飛ばしの杖で簡単にレベル99まで上がってしまった。HPもシレンのときは制限があったが、トルネコ2では500や600ぐらいになる。これも難易度を下げている。とは言っても強くなるのはうれしいのだが。

== ゼビウス(工事中)
== ドルアーガの塔(工事中)
