= 数独

== はじめに
((<パソコン初心者の館|URL:http://www.pro.or.jp/~fuji/index.html>)) にある、((<JAVAとパズルの世界|URL:http://www.pro.or.jp/~fuji/java/>))のパズルアプレットをJavaアプリとして移植しました。

== ダウンロード
* 実行ファイルのダウンロード ((<numplace-0.01.lzh|URL:numplace/numplace-0.01.lzh>))
* サンプル問題ファイルのダウンロード ((<001.prob|URL:numplace/001.prob>))
* ソースコードのダウンロード ((<numplace-src-0.01.tar.gz|URL:numplace/numplace-src-0.01.tar.gz>))

このソフトの実行には((<Javaランチャー|URL:javalaunch.html>))に対応してます。
setup.jarをダブルクリックし、「次へ」を押すとインストール可能です。インストールが完了するとデスクトップにショートカットが生成されます。アンインストーラはありませんので、アンインストールの際は手作業で削除してください。
デスクトップのショートカットに問題ファイルをドラッグ＆ドロップすると、ゲームスタートです。

== 最近の変更履歴
* 2002.5.15 Ver.0.01
* 2001.5.12 Ver.0.00

== 要望と問題点
 |内容                                                         |対策/対応Ver.|
 |ファイル選択ダイアログに対応                                 |Ver.0.01     |
 |Javaランチャーが無くても動作するように変更                   |Ver.0.01     |
 |Java Web Start対応                                           |Ver.0.01     |
 |デスクトップの問題ファイルをドラッグで開くことができない問題 |未           |
