= 滑りものの部屋

== はじめに
プログラミングとは全然関係ないが、スキー・インラインスケートのコーナーを作りました。

== お気軽滑りもの発見
私は滑りものが好きである。特にスキー、インラインスケートは大変楽しい。しかし、どちらも結構準備が大変で、気軽に楽しむというより、気合いを入れて「今から滑るぞー」みたいな感じだ。

インラインスケートでウィールの部分が脱着する製品も出ているようだが、やはり靴はでかいし、ウィールも気軽に持ち運ぶにしてはちょっとでかい。

そんなことを思いながら、店をぶらついていると、店員がなにやら店内で「スーッ」と滑っているではないか!!びっくりした私はよく観察してみた。どうやら靴になにやら仕掛けがあるらしい。最初はソープシューズと呼ばれるやつかと思ったが、あれは手すりなどを滑るためのものだ、今見ているのはどうやら違うらしい。

ようやくかかとだけにウィールが埋め込まれている靴だということを認識した。heelys(ヒーリーズ)という名前らしい。しかし、普通に歩いてると普通の靴に見えてしまうところがすごい。ちょっとした通勤に使えるのではないだろうか。今度、買って遊んでみたい。値段は1万5千円前後のようだ。
