= こだわりのツール

== こだわりソフト・ハード一覧

テキストファイル編集

* vivi
* Happy Hacking Keyboard Lite 2 (by PFU)
* 親指ひゅんQ
* ATOK12 (ちょっとバージョンが古いが..)
* cvs

プログラミング

* cygwin
* J2DK1.3
* Borland C++ Compiler 5.5

リンクしてないところはサーチエンジンで検索してください。

== モードのあるエディタとは
世の中のほとんどのエディタはモードレス(モードのない)エディタですが、私はモードエディタの方が効率がよいので、好きです。私はずっと秀丸エディタを使用していたのですが、最近はviviを使うようになりました。viviとはviというUNIX系でよく使用されているエディタのコマンドがほとんど使用できるエディタで、viモードを使用しなければ普通のモードレスエディタとしても使用可能です。

=== vivi vs 秀丸
秀丸エディタも長期間使ってきたので、秀丸の良さもよく理解しているつもりです。そこでviviにもあったら良いと思う機能を以下にあげてみました。

* マクロの記録開始、終了、実行
* 正規表現による行のハイライト表示

=== vivi vs jvim
viviにもvim(viの機能拡張版)の以下のコマンドがあれば便利だと考えます。

* "*"コマンドが使えない
* CTRL+Oなどのジャンプ機能がない

viviの作者の津田様からメールが入り、「"*"コマンドの代わりにCTRL+F3が使える」と教えていただきました。今後はCTRL+F3を使っていこうと思います。情報ありがとうございました。でも、"*"をCTRL+F3と同じ機能に割り当てたいです。それはファンクションキーはホームポジションから遠いこと、Happy Hacking KeyboardではFnキーを同時に押す必要があること、vimとの互換性のことといった理由からです。

== 親指シフト
日本語入力方式のこだわりをみなさまに伝えたいと思います。そして、親指シフト(NICOLA配列)キーボードの発展を願って。

=== ローマ字入力って、良いですか?
私はある日、ゲームセンターでタイピングのゲームをプレイしたことがあり、そのときはローマ字入力でプレイしていました。しかし、かな入力モードもあるみたいだったので、さらにハイスコアを目指すため、かな入力の練習を始めました。

=== かな入力って、良いですか?
かな入力にだいぶ慣れてきた頃、この入力方法は手が疲れることがわかってきました。確かにローマ字入力に比べるとストローク数は減るのですが、劇的には減らないし、なにより打ちにくいキーが多すぎます。濁音・半濁音や小さい「ぁ」や「ゃ」などが特に打ちにくいです。右シフトキーも多用しなければならないし、シフトキー自体打ちにくい位置にあります。

=== そこで親指シフト
結局、かな入力はローマ字入力の速度を超える前に断念してしまいました。実はこのときに親指シフトのことを思い出したのです。私は今まで親指シフトを使ったことがありませんでしたが、何かの雑誌で紹介されていたのを何となく覚えていたのです。早速インターネットで検索してみました。すると親指ひゅんQというフリーソフトで普通の日本語キーボードを親指シフトのように使えるということがわかりました。早速ダウンロードして試しました。

=== ひたすら練習の日々
しばらくはキー配列もわからず、仕事に支障があるので、仕事ではローマ字入力を使い、休み時間や家で親指シフトの練習をしていました。LessonQという練習用フリーソフトがあるので、これで分速100文字ぐらいが出せるようになった頃から仕事でも親指シフトを使うようにしていきました。しかし、分速100文字程度では遅くて、いらいらしながら入力していました。またしばらくして分速150文字が出せるようになってきた頃には、だいぶストレスもなくなってきました。ちなみに現在は分速200文字程度です。次の目標は分速250文字かな。分速200文字を超えてくるとローマ字での分速400文字ぐらいに相当するはずなので、かなり速くなったのではと思います。今度、試しに比較してみたいです。

=== 最後に
親指ひゅんQ、LessonQというすばらしいソフトをフリーで提供してくださった作者の方には大変感謝しております。ありがとうございました。親指シフトについて、詳しく知りたくなった方は日本語入力コンソーシアム(NICOLA)を覗いてみてください。

== IME98はいまいち
だいぶ前にIME98が漢字変換で変な変換ばっかりするので、頭にきてATOK12を購入しました。誤変換がかなり減ったため、ストレスが減り、時間も短縮できるようになりました。

== コンパクトなキーボード
私はテンキーもファンクションキーもあまり使わないため、テンキーなどを削ったコンパクトなキーボードをずっと探していました。Happy Hacking Keyboardは以前から目をつけてはいたのですが、英語配列のため、親指シフトには不向きなので購入していませんでした。ところが、最近日本語配列バージョンが発売されたので、早速購入しました。コンパクトでしかもかわいいのでとても気に入っています。これにIBMのSpace Saver Keyboardのようなトラック・ポイントがついてたらもっといいのになぁ。

== コンソールユーザーインターフェース
ほとんどのWindowsアプリケーションはグラフィカルなユーザーインターフェースを採用しており、とても使いやすいですが、場合によっては昔ながらのコンソールからコマンドを入力するといった方法が良いときもあります。かといって、MS-DOSプロンプトでは大したことができません。UNIXには大変便利なシェル(MS-DOSプロンプトに相当するもの)がいろいろあります。これをWindowsに移植したのがCygwinというやつです。ぜひみなさんも使ってみてください。
