= TypeR

== はじめに
このソフトは親指シフトでのタイピングスピードがローマ字入力時と比較して、どれぐらい速くなったのかを計測するために作成されました。

== ダウンロード
* 実行ファイルのダウンロード ((<type_r.lzh|URL:type_r/type_r.lzh>))
* ソースコードのダウンロード ((<type_r_src.lzh|URL:type_r/type_r_src.lzh>)) (紛失)

このソフトは((<Javaランチャー|URL:javalaunch.html>))に対応してます。
setup.jarをダブルクリックし、「次へ」を押すとインストール可能です。インストールが完了するとデスクトップにショートカットが生成されます。アンインストーラはありませんので、アンインストールの際は手作業で削除してください。
練習用テキストファイルをこのショートカットにドラッグ＆ドロップすることも可能です。

== サンプル練習ファイル
分野別の練習ファイルです。今後、増やしていく予定です。練習ファイルも受付中です。以下の「Coming soon!?」になっているのを、どなたか作ってもらえませんか？(笑)

* ぱぴぷぺぽ練習帳 ((<papipupe.txt|URL:type_r/papipupe.txt>))
* ちっちゃい文字練習帳 ((<minimoji.txt|URL:type_r/minimoji.txt>))
* The Type Of The Dead傾向と対策(Coming soon!?)
* 英語入り練習帳(Coming soon!?)
* メール・掲示板練習帳(Coming soon!?)

== 変更履歴
* 2001.7.2 Ver.0.04
  * ちっちゃい文字練習帳公開
* 2001.5.28 Ver.0.03
  * Java Launcherが無くても実行可能にしたときのバグ修正
  * ぱぴぷぺぽ練習帳公開
* 2001.5.27 Ver.0.02
  * Java Launcherが無くても実行可能にした
* 2001.5.25 Ver.0.01
  * 外部問題ファイルに対応
  * 次の問題に移る処理改善

== 要望と問題点
 |内容                                     |対策/対応Ver.|
 |段位認定機能                             |Ver.0.04     |
 |漢字での文字数をかなで計算するようにした |Ver.0.04     |
